```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.aws_organization.random_string.random: Refreshing state... [id=si38]
module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.aws_organization.aws_organizations_account.account: Refreshing state...
module.aws_organization.aws_organizations_account.account: Refreshing state... [id=656889719924]
module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-08-28 03:42:37.945259626 +0000 UTC]
module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-08-28 03:42:37.649079324 +0000 UTC]
module.dns.aws_route53_delegation_set.main: Refreshing state... [id=N00248303TX9WWXC3DUAK]
module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.aws_logging.aws_s3_bucket.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.dns.module.dns[0].aws_acm_certificate.apex_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/b12c66bc-f2e9-44d0-96f3-36800e820362]
module.dns.module.dns[1].aws_acm_certificate.apex_wildcard: Refreshing state... [id=arn:aws:acm:us-east-1:656889719924:certificate/ed97c16d-9ff0-421f-b848-8b0618841abb]
module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=2777606739]
module.aws_logging.aws_kms_key.cloudtrail: Refreshing state... [id=f206c800-14d0-4612-86cd-bd6b80b2045e]
module.aws_api_gateway.aws_api_gateway_account.account: Refreshing state... [id=api-gateway-account]
module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.aws_logging.aws_cloudtrail.cloudtrail: Refreshing state... [id=cloudtrail]
module.aws_logging.aws_s3_bucket_public_access_block.logs: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]
module.aws_logging.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=scaffoldly-si38-logs-cloudtrail]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.dns.module.dns[0].aws_acm_certificate.apex_wildcard will be destroyed
  - resource "aws_acm_certificate" "apex_wildcard" {
      - arn                       = "arn:aws:acm:us-east-1:656889719924:certificate/b12c66bc-f2e9-44d0-96f3-36800e820362" -> null
      - domain_name               = "scaffoldly.dev" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "scaffoldly.dev"
              - resource_record_name  = "_5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_2e16e8130ae11d1d1563bf977d42da86.zdxcnfdgtt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:656889719924:certificate/b12c66bc-f2e9-44d0-96f3-36800e820362" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.dns.module.dns[0].aws_acm_certificate.subdomain_wildcard will be destroyed
  - resource "aws_acm_certificate" "subdomain_wildcard" {
      - arn                       = "arn:aws:acm:us-east-1:656889719924:certificate/81791125-3b93-4d8c-9ba3-53439a8e1e99" -> null
      - domain_name               = "*.scaffoldly.dev" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.scaffoldly.dev"
              - resource_record_name  = "_5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_2e16e8130ae11d1d1563bf977d42da86.zdxcnfdgtt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:656889719924:certificate/81791125-3b93-4d8c-9ba3-53439a8e1e99" -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [] -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.dns.module.dns[0].aws_route53_record.verification_record["scaffoldly.dev"] will be destroyed
  - resource "aws_route53_record" "verification_record" {
      - fqdn    = "_5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev" -> null
      - id      = "Z09011832P733251NUAHX__5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev._CNAME" -> null
      - name    = "_5d42b6204724f370284a161fa6ef6dab.scaffoldly.dev" -> null
      - records = [
          - "_2e16e8130ae11d1d1563bf977d42da86.zdxcnfdgtt.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z09011832P733251NUAHX" -> null
    }

  # module.dns.module.dns[0].aws_route53_zone.zone will be destroyed
  - resource "aws_route53_zone" "zone" {
      - comment           = "Managed by Terraform" -> null
      - delegation_set_id = "N00248303TX9WWXC3DUAK" -> null
      - force_destroy     = false -> null
      - id                = "Z09011832P733251NUAHX" -> null
      - name              = "scaffoldly.dev" -> null
      - name_servers      = [
          - "ns-1477.awsdns-56.org",
          - "ns-1883.awsdns-43.co.uk",
          - "ns-476.awsdns-59.com",
          - "ns-991.awsdns-59.net",
        ] -> null
      - tags              = {} -> null
      - zone_id           = "Z09011832P733251NUAHX" -> null
    }

  # module.dns.module.dns[1].aws_acm_certificate.apex_wildcard will be destroyed
  - resource "aws_acm_certificate" "apex_wildcard" {
      - arn                       = "arn:aws:acm:us-east-1:656889719924:certificate/ed97c16d-9ff0-421f-b848-8b0618841abb" -> null
      - domain_name               = "scaffold.ly" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "scaffold.ly"
              - resource_record_name  = "_7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_8d0cd48ec113e127fa88fb6ef9796a5e.zdxcnfdgtt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:656889719924:certificate/ed97c16d-9ff0-421f-b848-8b0618841abb" -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [] -> null
      - tags                      = {} -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.dns.module.dns[1].aws_acm_certificate.subdomain_wildcard will be destroyed
  - resource "aws_acm_certificate" "subdomain_wildcard" {
      - arn                       = "arn:aws:acm:us-east-1:656889719924:certificate/24bede64-917d-4589-82e3-7d27ad2cdcc8" -> null
      - domain_name               = "*.scaffold.ly" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.scaffold.ly"
              - resource_record_name  = "_7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_8d0cd48ec113e127fa88fb6ef9796a5e.zdxcnfdgtt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:656889719924:certificate/24bede64-917d-4589-82e3-7d27ad2cdcc8" -> null
      - status                    = "PENDING_VALIDATION" -> null
      - subject_alternative_names = [] -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.dns.module.dns[1].aws_route53_record.verification_record["scaffold.ly"] will be destroyed
  - resource "aws_route53_record" "verification_record" {
      - fqdn    = "_7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly" -> null
      - id      = "Z08393103BT7N9U33F6L7__7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly._CNAME" -> null
      - name    = "_7442a2ae3c77e4c5d4bdc09c99cb7fd4.scaffold.ly" -> null
      - records = [
          - "_8d0cd48ec113e127fa88fb6ef9796a5e.zdxcnfdgtt.acm-validations.aws.",
        ] -> null
      - ttl     = 60 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z08393103BT7N9U33F6L7" -> null
    }

  # module.dns.module.dns[1].aws_route53_zone.zone will be destroyed
  - resource "aws_route53_zone" "zone" {
      - comment           = "Managed by Terraform" -> null
      - delegation_set_id = "N00248303TX9WWXC3DUAK" -> null
      - force_destroy     = false -> null
      - id                = "Z08393103BT7N9U33F6L7" -> null
      - name              = "scaffold.ly" -> null
      - name_servers      = [
          - "ns-1477.awsdns-56.org",
          - "ns-1883.awsdns-43.co.uk",
          - "ns-476.awsdns-59.com",
          - "ns-991.awsdns-59.net",
        ] -> null
      - tags              = {} -> null
      - zone_id           = "Z08393103BT7N9U33F6L7" -> null
    }

  # module.dns.module.dns["live"].aws_acm_certificate.apex will be created
  + resource "aws_acm_certificate" "apex" {
      + arn                       = (known after apply)
      + domain_name               = "scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"] will be created
  + resource "aws_route53_record" "verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns["live"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = "N00248303TX9WWXC3DUAK"
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffold.ly"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

  # module.dns.module.dns["nonlive"].aws_acm_certificate.apex will be created
  + resource "aws_acm_certificate" "apex" {
      + arn                       = (known after apply)
      + domain_name               = "scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"] will be created
  + resource "aws_route53_record" "verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.dns.module.dns["nonlive"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = "N00248303TX9WWXC3DUAK"
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffoldly.dev"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

Plan: 8 to add, 0 to change, 8 to destroy.

Changes to Outputs:
  + foo = {
      + live    = {
          + certifcate_arn = (known after apply)
          + domain         = "scaffold.ly"
        }
      + nonlive = {
          + certifcate_arn = (known after apply)
          + domain         = "scaffoldly.dev"
        }
    }

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```